const mongoose = require('mongoose');

// 🔥 BOT USER DATABASE MODEL 🔥
const BotUserSchema = new mongoose.Schema({
    name: String,
    phone: String,
    isActive: { type: Boolean, default: true },
    lastPlayed: { type: Date, default: 0 } 
});

const BotUser = mongoose.model('BotUser', BotUserSchema);

// ስሞቹን Database ውስጥ የሚያስገባው Function
async function initBotDatabase() {
    let c = await BotUser.countDocuments();
    if(c === 0) {
        const botNames = ["አበበ","ጫላ","አስቴር","ሄኖክ","ዳዊት","ማክዳ","ዮሴፍ","ቃልኪዳን","ሳሙኤል","ቤዛዊት","አለሙ","ተስፋዬ","መሰረት","ሀና","ዮናስ","ናትናኤል","እየሩሳሌም","ኤደን","ቢኒያም","ቴዎድሮስ","አብርሀም","ሳራ","አቤል","ሚካኤል","ዘላለም","ፍሬዘር","እንዳለ","ብርሀኑ","ጌታሁን","መላኩ","አየለ","በላይ","ሀይሌ","ታደሰ","ታምራት","አማኑኤል","ሀብታሙ","ደጀኔ","አዳነ","አሊ","ከድር","ጀማል","ፋጡማ","አሚና","ሰሚራ","አስናቀች","ፀሀይ","ሮማን","መቅደስ","ትዕግስት","ሰለሞን","ዳንኤል","ኤርሚያስ","በእምነት","አሮን","ናሆም","ኪሩቤል","ያብስራ","በረከት","ቸርነት","አሸናፊ","ድልነሳው","ይሁኔ","ጌትነት","ደሳለኝ","አለማየሁ","ተፈራ","ካሳሁን","ሺፈራው","በቀለ","ቶሎሳ","ጉዲሳ","ፈይሳ","ጫልቱ","ለሚ","አበራ","ደመቀ","አንዷለም","ስዩም","ዘነበ","ሙላቱ","ታሪኩ","አግማስ","ጌታቸው","ወርቁ","ሰይፉ","ጥላሁን","ማህሙድ","ኑሩ","ከማል","ሰኢድ","ሀሰን","ዑስማን","አብዱል","ረሂማ","ዘይነብ","ሀዋ","አያንቱ","ኩመራ","ገመቹ", "አስማረ", "ብርሃኔ", "ተዋበች", "ሙላት", "ፍሬህይወት", "አሳምነው", "አለልኝ", "ተመስገን", "አበባው", "ካሳ", "ዘነበች", "አባተ", "አየለች", "ታደለ", "ጌጡ", "ስንታየሁ", "ወጋየሁ", "አማረ", "አስቻለው", "በለጠ"];
        for(let i=0; i<100; i++) {
            await BotUser.create({
                name: botNames[i] || "Bot " + i,
                phone: "09" + Math.floor(Math.random() * 90000000 + 10000000)
            });
        }
    }
}

// ለሌሎች ፋይሎች አሳልፎ ለመስጠት (Export)
module.exports = { BotUser, initBotDatabase };
